Repository: tetra-framework/tetra
Catalog: demosite/locale/*/LC_MESSAGES/django.po
Languages: es

source: Information
es: Información

source: Enter your name below!
es: ¡Introduce tu nombre aquí!

source: Thanks,
es: Gracias,

source: Your name
es: Tu nombre

source: Ok
es: Aceptar

source: Search for an 80s movie...
es: Busca una película de los 80...

source: New task...
es: Nueva tarea...

source: Add
es: Añadir

source: Name:
es: Nombre:

source: Submit
es: Enviar

source: Load data (local spinner)
es: Cargar datos (spinner local)

source: Load data (external spinner)
es: Cargar datos (spinner external)

source: A Christmas Story
es: Una historia de Navidad

source: A Fish Called Wanda
es: Un pez llamado Wanda

source: A Nightmare on Elm Street
es: Pesadilla en Elm Street

source: Adventures in Babysitting
es: Aventuras en la gran ciudad

source: After Hours
es: Jo, qué noche

source: Airplane!
es: ¡Aterriza como puedas!

source: Au Revoir, les enfants
es: Adiós, muchachos

source: Back to the Future
es: Regreso al futuro

source: Beetlejuice
es: Bitelchús

source: Better Off Dead
es: Mejor muerto

source: Beverly Hills Cop
es: Superdetective en Hollywood

source: Big Trouble in Little China
es: Golpe en la pequeña China

source: Bill & Ted's Excellent Adventure
es: Las alucinantes aventuras de Bill y Ted

source: Blue Velvet
es: Terciopelo azul

source: Body Heat
es: Fuego en el cuerpo

source: Broadcast News
es: Al filo de la noticia

source: Caddyshack
es: El club de los chalados

source: Coming to America
es: El príncipe de Zamunda

source: Dead Poets Society
es: El club de los poetas muertos

source: Desperately Seeking Susan
es: Buscando a Susan desesperadamente

source: Die Hard
es: Jungla de cristal

source: Do the Right Thing
es: Haz lo que debas

source: Dragonslayer
es: El dragón del lago de fuego

source: E.T. the Extra-Terrestrial
es: E.T., el extraterrestre

source: Escape From New York
es: 1997: Rescate en Nueva York

source: Evil Dead 2
es: Evil Dead II

source: Fast Times at Ridgemont High
es: Aquel excitante curso

source: Ferris Bueller's Day Off
es: Todo en un día

source: Field of Dreams
es: Campo de sueños

source: Flight of the Navigator
es: El vuelo del navegante

source: Friday the 13th
es: Viernes 13

source: Full Metal Jacket
es: La chaqueta metálica

source: Ghostbusters
es: Los Cazafantasmas

source: Grave of the Fireflies
es: La tumba de las luciérnagas

source: Hannah and Her Sisters
es: Hannah y sus hermanas

source: Heathers
es: Escuela de jóvenes asesinos

source: Highlander
es: Los inmortales

source: Indiana Jones and the Last Crusade
es: Indiana Jones y la última cruzada

source: Indiana Jones and the Temple of Doom
es: Indiana Jones y el templo maldito

source: Labyrinth
es: Dentro del laberinto

source: Ladyhawke
es: Lady Halcón

source: Lethal Weapon
es: Arma letal

source: Little Shop of Horrors
es: La pequeña tienda de los horrores

source: Lost in America
es: Perdidos en América

source: Mad Max 2
es: Mad Max 2: El guerrero de la carretera

source: Moonstruck
es: Hechizo de luna

source: My Left Foot
es: Mi pie izquierdo

source: My Life as a Dog
es: Mi vida como un perro

source: My Neighbor Totoro
es: Mi vecino Totoro

source: National Lampoon's Vacation
es: Las vacaciones de una chiflada familia americana

source: Near Dark
es: Los viajeros de la noche

source: Planes, Trains and Automobiles
es: Mejor solo que mal acompañado

source: Predator
es: Depredador

source: Pretty in Pink
es: La chica de rosa

source: Raging Bull
es: Toro salvaje

source: Raiders of the Lost Ark
es: En busca del arca perdida

source: Raising Arizona
es: Arizona Baby

source: Real Genius
es: Genio y figura

source: Return to Oz
es: Oz, un mundo fantástico

source: Revenge of the Nerds
es: La venganza de los nerds

source: Say Anything...
es: Un gran amor

source: Short Circuit
es: Cortocircuito

source: Sid & Nancy
es: Sid y Nancy

source: Sixteen Candles
es: Dieciséis velas

source: Sleepaway Camp
es: Campamento sangriento

source: St. Elmo's Fire
es: St. Elmo, punto de encuentro

source: Stand by Me
es: Cuenta conmigo

source: Star Wars: Episode V -- The Empire Strikes Back
es: Star Wars: Episodio V - El Imperio contraataca

source: Star Wars: Episode VI -- Return of the Jedi
es: Star Wars: Episodio VI - El retorno del Jedi

source: Steel Magnolias
es: Magnolias de acero

source: Stripes
es: El pelotón chiflado

source: Terms of Endearment
es: La fuerza del cariño

source: The Adventures of Buckaroo Banzai Across the Eighth Dimension
es: Las aventuras de Buckaroo Banzai a través de la octava dimensión

source: The Blues Brothers
es: Granujas a todo ritmo

source: The Boat
es: El submarino

source: The Breakfast Club
es: El club de los cinco

source: The Color Purple
es: El color púrpura

source: The Goonies
es: Los Goonies

source: The Karate Kid
es: Karate Kid

source: The Land Before Time
es: En busca del valle encantado

source: The Last Starfighter
es: El último guerrero espacial

source: The Little Mermaid
es: La Sirenita

source: The Lost Boys
es: Jóvenes ocultos

source: The Naked Gun
es: Agárralo como puedas

source: The Neverending Story
es: La historia interminable

source: The Princess Bride
es: La princesa prometida

source: The Return of the Living Dead
es: El regreso de los muertos vivientes

source: The Shining
es: El resplandor

source: The Terminator
es: Terminator

source: The Thing
es: La cosa

source: The Toxic Avenger
es: El Vengador Tóxico

source: The Transformers: The Movie
es: Transformers: La película

source: The Untouchables
es: Los intocables de Eliot Ness

source: They Live
es: Están vivos

source: Time Bandits
es: Los héroes del tiempo

source: To Live and Die in L.A.
es: Vivir y morir en Los Ángeles

source: Trading Places
es: De mendigo a millonario

source: Valley Girl
es: La chica del valle

source: WarGames
es: Juegos de guerra

source: Weird Science
es: Ciencia extraña

source: When Harry Met Sally...
es: Cuando Harry encontró a Sally...

source: Who Framed Roger Rabbit
es: ¿Quién engañó a Roger Rabbit?

source: Working Girl
es: Armas de mujer

source: Toggle Examples Navigation
es: Alternar Navegación de Ejemplos

source: Toggle Navigation
es: Alternar Navegación

source: Examples
es: Ejemplos

source: Browse Examples
es: Explorar Ejemplos

source: Close
es: Cerrar

source: Tetra Docs
es: Docs de Tetra

source: Alpine.js Docs
es: Docs de Alpine.js

source: Django Docs
es: Docs de Django

source: On this page
es: En esta página

source: Click the line below to start editing.
es: Haga clic en la línea a continuación para comenzar a editar.

source: Full stack reactive component framework for <a href="http://djangoproject.com">Django</a> using <a href="https://alpinejs.dev">Alpine.js</a>
es: Framework de componentes reactivos full-stack para <a href="http://djangoproject.com">Django</a> usando <a href="https://alpinejs.dev">Alpine.js</a>

source: Features
es: Características

source: Get Started
es: Comenzar

source: See how easy it is to build a <mark>todo list</mark>
es: Mira lo fácil que es construir una <mark>lista de tareas</mark>

source: Python: Todo Item
es: Python: Elemento de Tarea

source: HTML: Todo List
es: HTML: Lista de Tareas

source: Python: Models
es: Python: Elemento de Tarea

source: Or a reactive server rendered search component:
es: O un componente de búsqueda reactiva renderizado en el servidor:

source: Or a counter, but with multiple nested instances.
es: O un contador, pero con múltiples instancias anidadas.

source: Or a simple card, with dynamic content.
es: O una tarjeta simple, con contenido dinámico.

source: Not convinced? How about a reactive news ticker with push notifications?
es: ¿No estás convencido? ¿Qué tal un ticker de noticias reactivo con notificaciones push?

source: Async server code
es: Código de servidor asíncrono

source: The following (partly fake) news line is not polled, but pushed from the server to all connected clients simultaneously each 10 seconds.
es: La siguiente línea de noticias (parcialmente falsa) no se consulta, sino que se envía desde el servidor a todos los clientes conectados simultáneamente cada 10 segundos.

source: This might look trivial, you could do that with polling too. But Tetra is smarter than that.<br/> <a href="." target="_blank">Open multiple browsers/tabs with this very page</a>, even on your phone, and watch the news change simultaneously.<br/> An async django task worker is pushing the news to all connected clients.
es: Esto puede parecer trivial, también podrías hacerlo con polling. Pero Tetra es más inteligente que eso.<br/> <a href="." target="_blank">Abre múltiples navegadores/pestañas con esta misma página</a>, incluso en tu teléfono, y observa cómo las noticias cambian simultáneamente.<br/> Un trabajador de tareas asíncronas de Django está enviando las noticias a todos los clientes conectados.

source: What does Tetra do?
es: ¿Qué hace Tetra?

source: <a href="http://djangoproject.com">Django</a> on the backend, <a href="https://alpinejs.dev">Alpine.js</a> in the browser
es: <a href="http://djangoproject.com">Django</a> en el backend, <a href="https://alpinejs.dev">Alpine.js</a> en el navegador

source: Tetra combines the power of Django with Alpine.js to make development easier and quicker.
es: Tetra combina el poder de Django con Alpine.js para hacer el desarrollo más fácil y rápido.

source: Component encapsulation
es: Encapsulación de componentes

source: Each component combines its Python, HTML, CSS and JavaScript in one place for close proximity of related code.
es: Cada componente combina su Python, HTML, CSS y JavaScript en un solo lugar para mantener la proximidad del código relacionado.

source: Async HTTP calls
es: Llamadas HTTP asíncronas

source: Server calls are asynchronous, ensuring the frontend remains responsive. Multiple, fast clicks on the same button are not dropped between HTTP calls.
es: Las llamadas al servidor son asíncronas, asegurando que el frontend se mantenga receptivo. Múltiples clics rápidos en el mismo botón no se pierden entre llamadas HTTP.

source: Resumable server state
es: Estado de servidor reanudable

source: The components' full server state is saved between public method calls. This state is <a href="https://tetra.readthedocs.io/en/latest/state-security/">encrypted for security</a>.
es: El estado completo del servidor de los componentes se guarda entre llamadas a métodos públicos. Este estado está <a href="https://tetra.readthedocs.io/en/latest/state-security/">cifrado por seguridad</a>.

source: Public server methods
es: Métodos de servidor públicos

source: Methods can be made public, allowing you to easily call them from JS on the front end, resuming the component's state.
es: Los métodos pueden hacerse públicos, permitiendo llamarlos fácilmente desde JS en el frontend, reanudando el estado del componente.

source: Shared public state
es: Estado público compartido

source: Attributes can be decorated to indicate they should be available in the browser as Alpine.js data objects.
es: Los atributos pueden ser decorados para indicar que deben estar disponibles en el navegador como objetos de datos de Alpine.js.

source: Server "watcher" methods
es: Métodos "watcher" del servidor

source: Public methods can be instructed to watch a public attribute, enabling reactive re-rendering on the server.
es: Los métodos públicos pueden ser instruidos para observar un atributo público, permitiendo la re-renderización reactiva en el servidor.

source: Inplace updating from the server
es: Actualización en el sitio desde el servidor

source: Server methods can update the rendered component in place. Powered by the Alpine.js morph plugin.
es: Los métodos del servidor pueden actualizar el componente renderizado en el sitio. Impulsado por el plugin morph de Alpine.js.

source: Component library packaging
es: Empaquetado de la librería de componentes

source: Every component belongs to a \
es: Cada componente pertenece a un \

source: Components can have multiple <code>
es: Componentes pueden tener múltiples <code>

source: </code> which can be overridden when used.
es: </code> que pueden ser sobreescritos cuando se usan.

source: JS/CSS builds using <a href="https://esbuild.github.io">esbuild</a>
es: Compilaciones JS/CSS usando <a href="https://esbuild.github.io">esbuild</a>

source: Both for development (built into <code>runserver</code>) and production your JS & CSS is built with esbuild.
es: Tanto para desarrollo (integrado en <code>runserver</code>) como para producción, tu JS y CSS se compila con esbuild.

source: Source Maps
es: Mapas de origen

source: Source maps are generated during development so that you can track down errors to the original Python files.
es: Los mapas de origen se generan durante el desarrollo para que puedas rastrear errores hasta los archivos Python originales.

source: Syntax highlighting with type annotations
es: Resaltado de sintaxis con anotaciones de tipo

source: Tetra uses type annotations to syntax highlight your JS, CSS & HTML in your Python files with a <a href="https://github.com/samwillis/python-inline-source/tree/main/vscode-python-inline-source">VS Code plugin</a>
es: Tetra utiliza anotaciones de tipo para resaltar la sintaxis de tu JS, CSS y HTML en tus archivos Python con un <a href="https://github.com/samwillis/python-inline-source/tree/main/vscode-python-inline-source">plugin de VS Code</a>

source: Form components
es: Componentes de formulario

source: A simple replacement for Django's FormView, but due to Tetra's dynamic nature, e.g. a field can change its value or disappear depending on other fields' values.
es: Un reemplazo simple para el FormView de Django, pero debido a la naturaleza dinámica de Tetra, por ejemplo, un campo puede cambiar su valor o desaparecer dependiendo de los valores de otros campos.

source: Event subscriptions
es: Suscripciones a eventos

source: Both frontend and backend components can subscribe to JavaScript events, enabling seamless event-driven programming across the full stack.
es: Tanto los componentes de frontend como los de backend pueden suscribirse a eventos de JavaScript, permitiendo una programación fluida basada en eventos en todo el stack.

source: File upload/downloads
es: Carga/descarga de archivos

source: Whenever a form contains a FileField, Tetra makes sure the uploading process works smooth, even with page reloads.
es: Siempre que un formulario contiene un FileField, Tetra se asegura de que el proceso de carga funcione sin problemas, incluso con recargas de página.

source: Integration with Django Messages
es: Integración con Mensajes de Django

source: Django's messaging framework is deeply integrated into Tetra: Whenever a new message occurs, it is transformed into a JavaScript object and sent as an event that can be subscribed to by any component.
es: El framework de mensajería de Django está profundamente integrado en Tetra: Siempre que ocurre un nuevo mensaje, se transforma en un objeto JavaScript y se envía como un evento al que cualquier componente puede suscribirse.

source: Loading indicators
es: Indicadores de carga

source: While an AJAX request is in flight, you can show a loading indicator, globally, per component, or per call.
es: Mientras una solicitud AJAX está en curso, puedes mostrar un indicador de carga, globalmente, por componente o por llamada.

source: Component data can be updated from the server using websockets/push notification, even by async Django background tasks, Celery, signals etc.
es: Los datos del componente pueden actualizarse desde el servidor usando websockets/notificaciones push, incluso por tareas de fondo asíncronas de Django, Celery, señales, etc.

source: More features are planned, including:
es: Más características planificadas, incluyendo:

source: ModelComponent for bootstrapping standard CRUD interactions.
es: ModelComponent para iniciar interacciones CRUD estándar.

source: Python type annotations
es: Resaltado de sintaxis con anotaciones de tipo

source: Integration with Django Validators
es: Integración con Mensajes de Django

source: Routing <s>and query strings ✅</s> for "whole page" components.
es: Enrutamiento <s>y cadenas de consulta ✅</s> para componentes de "página completa".

source: Page title and metadata in header.
es: Título de página y metadatos en el encabezado.

source: Pagination and Infinity Scroll components.
es: Paginación y componente de desplazamiento infinito.

source: PostCSS/SASS/etc. support.
es: Soporte PostCSS/SASS/etc.

source: CSS scoped to a component.
es: CSS acoplado a un componente.

source: Redirect responses.
es: Respuestas de redirección.

source: Additional authentication tools.
es: Herramientas de autenticación adicionales.

source: Integration with UI & component toolkits.
es: Integración con UI y kits de herramientas de componentes.

source: Bundling of esbuild to be npm free.
es: Agrupación de esbuild para que esté libre de npm.

source: Read the Docs to get started
es: Lee la documentación para empezar

source: I'm so excited!
es: ¡Estoy muy emocionado!

source: We got news for you.
es: Tenemos noticias para ti.

source: Hi {name}! No further news.
es: ¡Hola {name}! No hay más noticias.

source: Discover Tetra
es: Descubra Tetra

source: Install and explore Tetra
es: Instalar y explorar Tetra

source: Decide to build your next startup using Tetra
es: Decide construir tu próxima startup usando Tetra

source: Become a billionaire
es: Conviértete en multimillonario

source: Start a rocket company
es: Iniciar una empresa de cohetes

source: Populate Pluto, it's a much cooler planet than Mars
es: Poblar Plutón, es un planeta mucho más frío que Marte.

source: English
es: Inglés

source: Spanish
es: Español
